# brewfile
cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "rcmdnk/file"

brew "anyenv"
brew "ctags"
brew "fzf"
brew "git"
brew "global"
brew "mas"
brew "nkf"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh"

cask "1password"
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "coteditor"
cask "docker"
cask "font-ricty-diminished"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "kindle"

# free app
mas "Skitch", id: 425955336
mas "Slack", id: 803453959

# payment app
mas "BetterSnapTool", id: 417375580
mas "FreeMan", id: 510934532
mas "MonthlyCal", id: 935250717
mas "Spark", id: 1176895641
mas "Translate Tab", id: 458887729
mas "Transmit", id: 403388562
